1.โปรแกรมลงทะเบียนเข้าร่วมกิจกรรมของนักเรียน คือ โปรแกรมที่ใช้สำหรับให้นักเรียนลงทะเบียนเมื่อมาเข้าร่วมกิจกรรม ที่ทางโรงเรียนจัด ขึ้นและนำข้อมูลไปประเมินของแต่ละกิจกรรม
2. โปรแกรมคัดกรองนักเรียน (หาอาการผิดปกติ เช่น ไขหวัดใหญ่) คือโปรแกรม ที่ช่วยบันทึกประวัติการป่วย และคัดกรองนักเรียนที่มีภาวะเสี่ยงต่อการแพร่กระจาย พร้อมสรุปผลแต่ละวัน หรือจบการใช้งาน


3. โปรแกรมส่งงาน ส่งการบ้าน ผ่าน HTTP คือ โปรแกรมที่ใช้สำหรับ สั่งงาน การบ้าน ให้นักเรียน และนักเรียนสามารถส่งงาน ที่ได้รับกลับมาให้ อาจารย์แต่ละวิชาได้ และอาจารย์สามารถเช็คการส่งงานและให้คะแนนนักเรียนได้ทันที
4. โปรแกรมสร้างห้องสนทนาในสถานศึกษา ผ่าน HTTP คือ โปรแกรม สร้างกลุ่มพูดคุยในระบบคอมพิวเตอร์ โดยมีการสร้างห้องสนทนาและผู้เข้าร่วมสนทนา และส่งข้อมูล ไฟล์ หรือ ภาพ ได้
5. โปรแกรมโหวตออกเสียง ผ่าน HTTP คือ โปรแกรมที่ส่งเสริมการมีส่วนร่วมการออกเสียง เพื่อ ส่งเสริมการมีส่วนร่วมในระบอบประชาธิปไตย

6. โปรแกรมจำหน่ายสินค้าในสหกรณ์ โรงเรียน คือ โปรแกรมสำหรับลงบันทึกการจำหน่ายสินค้าของสหกรณ์ และสรุปยอดรายได้แต่ละวันอย่างง่าย
7. โปรแกรมเช็คชื่อเข้าชั้นเรียน ผ่าน HTTP คือ โปรแกรมที่ อ. จะเป็นผู้เช็คชื่อ และให้คะแนนนักเรียน ระหว่างการเรียน หรือจบคาบเรียน และสรุปผลแต่ละวัน สัปดาห์ ของห้องเรียนนั้นๆ
8. โปรแกรม ระบบจัดเก็บเอกสาร เพื่อการสืบค้น ผ่าน HTTP คือ ระบบงานที่ เจ้าหน้าที่บันทึกหนังสือราชการต่าง บันทึกข้อความเข้าไปเก็บในรูปแบบ ดิจิตอล เพื่อความสะดวกในการเรียกใช้งานข้อมูล และประหยัดพื้นที่จัดเก็บเอกสาร

9. โปรแกรม 
10. โปรแกรม